In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1={
    "name":['harry','vansh','rajesh','max'],
    "marks":[12,23,34,45],
    "city":['mumbai','chennai','kolkata','delhi']
}

In [4]:
df=pd.DataFrame(dict1)

In [5]:
df

     name  marks     city
0   harry     12   mumbai
1   vansh     23  chennai
2  rajesh     34  kolkata
3     max     45    delhi

In [6]:
df.to_csv('friends.csv')

In [7]:
df.to_csv('friends_index_false.csv',index=False)

In [8]:
df.head(2)

    name  marks     city
0  harry     12   mumbai
1  vansh     23  chennai

In [9]:
df.tail(3)

     name  marks     city
1   vansh     23  chennai
2  rajesh     34  kolkata
3     max     45    delhi

In [10]:
df.describe()

           marks
count   4.000000
mean   28.500000
std    14.200939
min    12.000000
25%    20.250000
50%    28.500000
75%    36.750000
max    45.000000

In [11]:
vansh= pd.read_csv('friends.csv')

In [12]:
vansh

   Unnamed: 0    name  marks     city
0           0   harry     12   mumbai
1           1   vansh     23  chennai
2           2  rajesh     34  kolkata
3           3     max     45    delhi

In [13]:
vansh['name']

0     harry
1     vansh
2    rajesh
3       max
Name: name, dtype: object

In [14]:
vansh

   Unnamed: 0    name  marks     city
0           0   harry     12   mumbai
1           1   vansh     23  chennai
2           2  rajesh     34  kolkata
3           3     max     45    delhi

In [15]:
vansh.to_csv('vansh.csv')

In [16]:
vansh.index=['a','b','c','d']

In [17]:
vansh

   Unnamed: 0    name  marks     city
a           0   harry     12   mumbai
b           1   vansh     23  chennai
c           2  rajesh     34  kolkata
d           3     max     45    delhi

In [18]:
vansh

   Unnamed: 0    name  marks     city
a           0   harry     12   mumbai
b           1   vansh     23  chennai
c           2  rajesh     34  kolkata
d           3     max     45    delhi

In [19]:
ser2=pd.Series(np.random.rand(34))

In [20]:
ser2

0     0.494770
1     0.189105
2     0.175954
3     0.220309
4     0.885372
5     0.941152
6     0.249126
7     0.538233
8     0.059147
9     0.929609
10    0.727447
11    0.690296
12    0.162593
13    0.805164
14    0.953321
15    0.350171
16    0.463615
17    0.941570
18    0.993543
19    0.941488
20    0.749733
21    0.047520
22    0.776727
23    0.284417
24    0.751649
25    0.204150
26    0.348845
27    0.576561
28    0.371499
29    0.853908
30    0.652776
31    0.146980
32    0.950807
33    0.469816
dtype: float64

In [21]:
ser=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [22]:
ser

            0         1         2         3         4
0    0.484609  0.916972  0.794103  0.156086  0.539913
1    0.047462  0.993891  0.153975  0.922025  0.725175
2    0.002218  0.336681  0.432846  0.682589  0.346592
3    0.545994  0.481042  0.453650  0.581031  0.425159
4    0.227947  0.335205  0.422163  0.775736  0.920238
..        ...       ...       ...       ...       ...
329  0.414544  0.615181  0.617502  0.922850  0.156956
330  0.911351  0.798050  0.498373  0.801865  0.484596
331  0.773898  0.323143  0.639198  0.527970  0.996399
332  0.958235  0.080110  0.914576  0.529248  0.327117
333  0.367038  0.170735  0.386038  0.634983  0.418779

[334 rows x 5 columns]

In [25]:
type(ser2)

pandas.core.series.Series

In [26]:
ser.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.498164    0.525741    0.500157    0.493773    0.504579
std      0.282648    0.287001    0.296133    0.291015    0.285088
min      0.002218    0.014246    0.003768    0.001828    0.000385
25%      0.276512    0.273816    0.240746    0.237144    0.259067
50%      0.503458    0.530099    0.508795    0.481068    0.481354
75%      0.755731    0.787405    0.755484    0.748914    0.777138
max      0.990927    0.995829    0.997687    0.999823    0.996973

In [27]:
ser.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [28]:
ser2.index

RangeIndex(start=0, stop=34, step=1)

In [29]:
ser2

0     0.494770
1     0.189105
2     0.175954
3     0.220309
4     0.885372
5     0.941152
6     0.249126
7     0.538233
8     0.059147
9     0.929609
10    0.727447
11    0.690296
12    0.162593
13    0.805164
14    0.953321
15    0.350171
16    0.463615
17    0.941570
18    0.993543
19    0.941488
20    0.749733
21    0.047520
22    0.776727
23    0.284417
24    0.751649
25    0.204150
26    0.348845
27    0.576561
28    0.371499
29    0.853908
30    0.652776
31    0.146980
32    0.950807
33    0.469816
dtype: float64

In [30]:
ser2.to_numpy()

array([0.49477013, 0.18910472, 0.17595408, 0.22030904, 0.88537211,
       0.94115235, 0.24912597, 0.53823326, 0.05914724, 0.92960929,
       0.72744651, 0.69029583, 0.16259296, 0.80516378, 0.95332121,
       0.35017133, 0.46361456, 0.94156983, 0.9935426 , 0.94148807,
       0.74973302, 0.04751989, 0.77672713, 0.28441746, 0.75164866,
       0.20414982, 0.34884454, 0.57656072, 0.371499  , 0.85390811,
       0.6527756 , 0.14698024, 0.95080672, 0.46981613])

In [31]:
ser2.T

0     0.494770
1     0.189105
2     0.175954
3     0.220309
4     0.885372
5     0.941152
6     0.249126
7     0.538233
8     0.059147
9     0.929609
10    0.727447
11    0.690296
12    0.162593
13    0.805164
14    0.953321
15    0.350171
16    0.463615
17    0.941570
18    0.993543
19    0.941488
20    0.749733
21    0.047520
22    0.776727
23    0.284417
24    0.751649
25    0.204150
26    0.348845
27    0.576561
28    0.371499
29    0.853908
30    0.652776
31    0.146980
32    0.950807
33    0.469816
dtype: float64

In [32]:
ser2=pd.Series(np.random.rand(34))

In [34]:
ser2

0     0.943761
1     0.597672
2     0.215164
3     0.660486
4     0.048517
5     0.691757
6     0.127916
7     0.690125
8     0.005382
9     0.658903
10    0.253805
11    0.186352
12    0.933508
13    0.598029
14    0.309477
15    0.813569
16    0.193808
17    0.704839
18    0.269643
19    0.383224
20    0.431287
21    0.846947
22    0.878237
23    0.289173
24    0.560115
25    0.532838
26    0.714262
27    0.818443
28    0.398106
29    0.689973
30    0.671563
31    0.335898
32    0.721249
33    0.210504
dtype: float64